answer,question
F1,オンラインヘルプ、またはOfficeアシスタント
F2,アクティブセルを編集する
F3,名前の貼り付け
F4,直前のセル書式操作を繰り返す
F4,参照の切り替え
F6,［ワークシート，リボン，作業ウィンドウ，ズームコントロール］間で切り替わる（分割されているワークシートでのこのキーは、ウィンドウとリボン領域を切り替えるときに分割されたウィンドウも対象になる）
F7,英字スペルチェック
F8,選択範囲を拡張または解除できるようにする (拡張モードのオンとオフを切り替える)
F9,ブック再計算
F11,新規グラフシートを挿入する
Enter,基本セルを移動（方向は編集オプションによる）
Enter,作業ウィンドウ内のプルダウンリストを開閉する
Tab,右のセルへ移動、範囲選択されている場合は選択範囲内
Menu,コンテキストメニューを表示
Menu + A,選択範囲に名前を定義する
Delete,カーソル右側の文字を削除する（アクティブセルの書式やコメントを維持して内容を消去する）
End + Enter,同じ行の右端のセルにアクティブセルを移動する
ScrollLock + 方向キー,スクロールバーをキーで押下した方向へ動かす
ScrollLock + Home,ウィンドウの左隅のセルに移動します
Shift + F2,セルのメモ（旧コメント）を編集する
Shift + F3,関数の挿入
Shift + F4,直前の［検索］コマンドを繰り返す
Shift + F8,選択範囲を追加する
Shift + F9,シート再計算
Shift + Backspace,範囲の選択を解除し、アクティブセルだけを選択する
Shift + Home,選択範囲を行の先頭まで拡張する
Shift + PageDown,選択範囲を1画面下まで拡張する
Shift + PageUp,選択範囲を1画面上まで拡張する
Shift + Space,選択範囲を行全体に拡張する
Shift + 方向キー,選択範囲を拡張する
Shift + 方向キー,オブジェクトサイズの拡大縮小
Shift + Enter,基本セルを逆方向に移動（方向は編集オプションによる）
Shift + Tab,左のセルへ移動、範囲選択されている場合は選択範囲内
Ctrl + F1,リボンの表示と非表示の切り替え（2007以降）
Ctrl + F3,名前の管理
Ctrl + F8,ウィンドウのサイズを変更する
Ctrl + F9,ブックウィンドウを最小化する
Ctrl + F10,ブックウィンドウを最大化または元のサイズにする
Ctrl + 0,列（アウトライン）を非表示にする
Ctrl + 1,[セルの書式設定]ダイアログボックスを表示する
Ctrl + 5,取り消し線の設定と解除を切り替える
Ctrl + 6,オブジェクトの表示、非表示、および位置のみの表示を切り替える
Ctrl + 9,行（アウトライン）を非表示にする
Ctrl + A,連続セル範囲を選択する
Ctrl + A,ワークシート全体を選択する（連続セル範囲の選択ではない場合）
Ctrl + A,シートにあるすべてのオブジェクトを選択する（オブジェクトが1つ選択されている場合）
Ctrl + A,数式に関数名が入力されている場合、数式パレットを表示する
Ctrl + B,太字の書式の設定と解除を切り替える
Ctrl + C,選択範囲をコピーする
Ctrl + D,選択範囲内で下方向のセルにコピーする
Ctrl + D,オブジェクト選択時はオブジェクトを複製する
Ctrl + E,[フラッシュフィル]を呼び出し、隣接する列のパターンを自動認識して正しい列を入力する
Ctrl + F,検索
Ctrl + G,ジャンプおよびセル選択でオブジェクト選択
Ctrl + H,置換
Ctrl + I,斜体の書式の設定と解除を切り替える
Ctrl + J,［セルの書式設定］の［表示形式］［ユーザー定義］で、［種類(T)］の表示形式中にセル内改行を指定する
Ctrl + K,ハイパーリンクを挿入する
Ctrl + N,ファイルの新規作成
Ctrl + O,ファイルを開く
Ctrl + P,印刷
Ctrl + Q,選択したセルにデータが含まれるときに、［クイック分析］オプションを表示する
Ctrl + R,選択範囲内で右方向のセルにコピーする
Ctrl + S,上書き保存する
Ctrl + T,［テーブルの作成］ダイアログを表示する
Ctrl + U,下線の設定と解除を切り替える
Ctrl + V,コピーまたは切り取った範囲を貼り付ける
Ctrl + W,選択したブックウィンドウを閉じる
Ctrl + X,選択範囲を切り取る
Ctrl + Y,元に戻した操作をやり直す（直前の操作を繰り返す）
Ctrl + Z,直前の操作の実行結果を元に戻す
Ctrl + -,選択範囲のセルを削除する
Ctrl + :,現在の時刻を入力する
Ctrl + ;,現在の日付を入力する
Ctrl + @,［時刻]表示形式（hh:mmもしくは24時間表示）を設定する
Ctrl + [,選択範囲の数式が直接参照するセルを選択する
Ctrl + ],選択範囲のセルを直接参照する数式が入力されたセルを選択する
Ctrl + ^,［指数］表示形式（小数点以下の桁数2）を設定する
Ctrl + \(￥),選択された行でアクティブセルの値に一致しないセルを選択する
Ctrl + .,選択範囲の四隅を時計回りにアクティブにする
Ctrl + /,アクティブセルを含む配列を選択する
Ctrl + Delete,行の末尾までテキストを削除します
Ctrl + Backspace,アクティブセルが表示されるまでスクロールする
Ctrl + End,データが入力されている範囲の右下隅のセルに移動する
Ctrl + Enter,選択したセル範囲に、アクティブセルと同じ値を入力する
Ctrl + Home,ワークシートの先頭に移動する
Ctrl + PageDown,ブック内の次のシートをアクティブにする
Ctrl + PageUp,ブック内の前のシートをアクティブにする
Ctrl + Space,選択範囲を列全体に拡張する
Ctrl + Space,作業ウィンドウがアクティブとなっているときオプションを展開する
Ctrl + Tab,次のブックまたはウィンドウに移動や各種設定およびダイアログボックス内でのタブ移動
Ctrl + 方向キー,データ範囲の［先頭行，末尾行，左端列，右端列］に移動する
Ctrl + マウスホイール,ホイールの上下でズームの拡大表示（ホイール上方向）と縮小表示（ホイール下方向）
Ctrl + Shift + 1,桁区切りの表示形式を設定する
Ctrl + Shift + 2,アクティブセルの1つ上のセルの値を、アクティブセルまたは数式バーにコピーする
Ctrl + Shift + 3,［日付］表示形式（yyyy/mm/dd）を設定する
Ctrl + Shift + 4,［通貨］表示形式（\-1,234）を設定する
Ctrl + Shift + 5,［パーセンテージ］表示形式（小数点以下の桁数0）を設定する
Ctrl + Shift + 6,外枠の罫線を設定する
Ctrl + Shift + 7,アクティブセルの1つ上のセルの数式を、アクティブセルまたは数式バーにコピーする
Ctrl + Shift + 9,非表示の行（アウトライン）を表示する
Ctrl + Shift + A,数式に関数名が入力されている場合、その関数の引数名を( )で挿入する
Ctrl + Shift + L,フィルターを適用する
Ctrl + Shift + O,メモ（旧コメント）があるすべてのセルを選択する
Ctrl + Shift + U,数式バーを複数行に展開する（展開されている場合は1行に縮小する）
Ctrl + Shift + ; (+),セルを挿入する
Ctrl + Shift + @,セルの数式と計算結果の表示を切り替える
Ctrl + Shift + { ([),選択範囲の数式が直接または間接的に参照するすべてのセルを選択する
Ctrl + Shift + } (]),選択範囲のセルを直接または間接的に参照する数式が入力されたすべてのセルを選択する
Ctrl + Shift + _,罫線を削除する
Ctrl + Shift + ~ (^),標準の表示形式に設定する
Ctrl + Shift + : (*),アクティブセル領域 (アクティブセルを含み空白の行と列で囲まれているデータ領域で選択後はアクティブセルはデータの左上に移動する) を選択する
Ctrl + Shift + \ (￥),選択された列でアクティブセルの値に一致しないセルを選択します
Ctrl + Shift + > (.),テキストボックス内のフォントサイズを拡大する
Ctrl + Shift + < (,),テキストボックス内のフォントサイズを縮小する
Ctrl + Shift + F1,リボンとメニュー両方の表示と非表示の切り替え
Ctrl + Shift + F3,名前の作成
Ctrl + Shift + End,選択範囲をデータが入力されている範囲の右下隅のセルまで拡張する
Ctrl + Shift + Enter,数値を配列形式で入力したり数式を配列数式として入力する
Ctrl + Shift + Home,選択範囲をワークシートの先頭のセルまで拡張する
Ctrl + Shift + PageDown,ブックの現在のシートと次のシートを選択する
Ctrl + Shift + PageUp,ブックの現在のシートと前のシートを選択する
Ctrl + Shift + Tab,前のブックまたはウィンドウに移動や各種設定およびダイアログボックス内でのタブ移動
Ctrl + Shift + 方向キー,データが入力されている範囲の［先頭行，末尾行，左端列，右端列］まで選択範囲を拡張する
Ctrl + Alt + L,フィルターを再適用する
Ctrl + Alt + V,「形式を選択して貼り付け」ダイアログの表示(2007以降)
Alt,リボンとメニューをアクティブにする
Alt + ↓,選択したドロップダウンリストを開く
Alt + ←,図形選択時に図形を左回転させる
Alt + →,図形選択時に図形を右回転させる
Alt + ;,可視セルのみ選択
Alt + F1,グラフを挿入する
Alt + F2,名前を付けて保存する
Alt + F4,アプリケーション（Excel）を終了する
Alt + F8,マクロ
Alt + F11,Visual Basic Editor を起動する
Alt + Menu,挿入オプションを展開する
Alt + Enter,セル内で改行する（セル編集中の場合）
Alt + PageUp,1画面左にスクロールします
Alt + PagrDown,1画面右にスクロールします
Alt + Shift + 7,スタイルを編集する
Alt + Shift + =,SUM関数を挿入する
Alt + Shift + F1,新規ワークシートを挿入する
Alt + Shift + ↑,ふりがな編集
Alt + Shift + ↑,テキストボックス内ではテキストの行を上に移動（行の入れ替え）
Alt + Shift + ,テキストボックス内ではテキストの行を下に移動（行の入れ替え）
Alt + Shift + →,グループ化
Alt + Shift + →,テキストボックス内ではインデント
Alt + Shift + ←,グループを解除
Alt + Shift + ←,テキストボックス内ではインデントを戻す
Alt + Fn + PrtSc,アクティブウィンドウのみ撮影
Windows + Fn + PrtSc,連続撮影
